DIRECTORY = 'data/BanglaChar'

MAPPING = [ '<B>','<S>','<E>','<P>', 
           '০','১','২','৩','৪','৫','৬','৭','৮','৯',
            'ং', 'ঃ', 'অ', 'আ', 'ই', 'ঈ', 'উ', 'ঊ', 'ঋ', 'এ', 'ঐ', 'ও', 'ঔ', 
            'া', 'ি', 'ী', 'ু', 'ূ', 'ৃ', 'ে', 'ৈ', 'ো', 'ৌ', 'ঁ', '্',
            'ক','খ', 'গ', 'ঘ', 'ঙ', 'চ', 'ছ', 'জ', 'ঝ', 'ঞ', 'ট', 'ঠ', 'ড', 'ঢ', 'ণ', 'ত', 'থ', 'দ', 'ধ',
            'ন', 'প', 'ফ', 'ব', 'ভ', 'ম', 'য', 'র', 'ল', 'শ', 'ষ', 'স', 'হ', 'ৎ', 'ড়', 'ঢ়', 'য়']

MAX_LENGTH = 12
IMAGE_CHANNEL = 3
IMAGE_HEIGHT = 128
IMAGE_WIDTH = 224
INPUT_DIM = (IMAGE_CHANNEL,IMAGE_HEIGHT,IMAGE_WIDTH) 